[
  {
    "name": "VacationRenter",
    "desc": "Worked on the design and evolution of a large-scale vacation rental platform built to handle high traffic volumes and rapid growth.\n\nI contributed to a containerized microservices architecture using Docker and Kubernetes, enabling reliable service isolation, consistent environments, and smooth scalability across production systems. I helped design and maintain an automated CI/CD pipeline that streamlined build, test, and deployment workflows, significantly improving release velocity while reducing operational risk.",
    "images": [
      "VacationRenter-1.png",
      "VacationRenter-2.png",
      "VacationRenter-3.png"
    ],
    "links": {
      "view": "https://vacationrenter.com/",
      "code": "https://github.com/kidus-befekadu"
    }
  },
  {
    "name": "Cowboy",
    "desc": "Contributed to the development and evolution of Cowboy's digital platform, supporting the online presence of a connected e-bike brand focused on urban mobility and smart hardware experiences. \n\n I worked on scalable, user-facing systems that showcased products, technical features, and customer services such as test rides, leasing, accessories, and warranty management, ensuring a seamless experience from discovery through purchase. My work focused on building and maintaining reliable, performance-oriented web services and frontend integrations that supported high traffic volumes across multiple regions. \n\n I collaborated closely with product, design, and engineering teams to translate business and brand requirements into robust technical solutions, while ensuring the platform remained responsive, maintainable, and aligned with Cowboy's connected-device ecosystem. Throughout the project, I emphasized clean architecture, system reliability, and long-term scalability to support both e-commerce growth and evolving product capabilities.",
    "images": [
      "cowboy-1.png",
      "cowboy-2.png",
      "cowboy-3.png"
    ],
    "links": {
      "view": "https://cowbow.com/",
      "code": "https://github.com/kidus-befekadu"
    }
  },
  {
    "name": "Trioclear Smile Generator",
    "desc": "Worked on the development of an AI-powered web application that generates realistic smile previews by aligning teeth using a self-hosted machine learning model. \n\n I contributed to building the end-to-end workflow that allows users to securely upload dental images, process them through an internal AI inference pipeline, and return visually accurate, near-real-time results through a responsive web interface.My work focused on integrating the self-hosted AI model into scalable backend services, optimizing image processing performance, and ensuring reliable handling of user uploads. \n\n I collaborated closely with product, design, and clinical stakeholders to balance accuracy, usability, and system reliability, while implementing secure data handling practices suitable for sensitive medical imagery. Throughout the project, I emphasized maintainable architecture, performance optimization, and a smooth user experience to support both clinical use and consumer-facing interactions.",
    "images": [
      "trioclear-1.jpg",
      "trioclear-2.jpg",
      "trioclear-3.jpg",
      "trioclear-4.jpg"
    ],
    "links": {
      "view": "https://smilegenerator.trioclear.com/",
      "code": "https://github.com/kidus-befekadu"
    }
  },
  {
    "name": "Testing Playground Website",
    "desc": "Designed and developed a sandbox web application intended as a controlled environment for experimenting with modern web development techniques, frameworks, and architectural patterns. \n\n The platform served as a rapid prototyping space where new ideas could be validated before being introduced into production systems, reducing implementation risk and improving engineering confidence. I used the environment to evaluate frontend frameworks, backend service patterns, API integrations, and state-management strategies, while also testing CI/CD workflows, containerization setups, and performance optimization techniques. \n\n The project enabled iterative experimentation with scalable architectures, reusable component libraries, and event-driven communication patterns. Beyond prototyping, it functioned as a skill-refinement platform for exploring emerging tools, improving development workflows, and benchmarking performance across different technology stacks. This initiative strengthened system design decisions in production environments by allowing architectural trade-offs, integration approaches, and deployment strategies to be tested in isolation before wider adoption.",
    "images": [
      "testing-playground-1.jpg",
      "testing-playground-2.jpg",
      "testing-playground-3.jpg"
    ],
    "links": {
      "view": "https://www.testing-playground.andy-hk.com//",
      "code": "https://github.com/kidus-befekadu"
    }
  },
  {
    "name": "COSMOPEDIA",
    "desc": "Designed and developed a sandbox web application intended as a controlled environment for experimenting with modern web development techniques, frameworks, and architectural patterns. The platform served as a rapid prototyping space where new ideas could be validated before being introduced into production systems, reducing implementation risk and improving engineering confidence. \n\n I used the environment to evaluate frontend frameworks, backend service patterns, API integrations, and state-management strategies, while also testing CI/CD workflows, containerization setups, and performance optimization techniques. The project enabled iterative experimentation with scalable architectures, reusable component libraries, and event-driven communication patterns. \n\n Beyond prototyping, it functioned as a skill-refinement platform for exploring emerging tools, improving development workflows, and benchmarking performance across different technology stacks. This initiative strengthened system design decisions in production environments by allowing architectural trade-offs, integration approaches, and deployment strategies to be tested in isolation before wider adoption.",
    "images": [
      "cosmopedia-1.png",
      "cosmopedia-2.png",
      "cosmopedia-3.png",
      "cosmopedia-4.png"
    ],
    "links": {
      "view": "https://huggingface.co/spaces/aradhyapavan/casmopedia/",
      "code": "https://github.com/kidus-befekadu"
    }
  },
  {
    "name": "Daily Philosophy",
    "desc": "Designed and developed Daily Philosophy, a reflective web platform built to encourage independent critical thinking by intentionally limiting AI-assisted writing. \n\n The application presents a new thought-provoking question each day and challenges users to submit their own reflections within a 24-hour window, reinforcing cognitive engagement and consistent intellectual practice.I architected the platform with a focus on simplicity, clarity, and behavioral design principles, ensuring that the user experience promotes deliberate thinking rather than passive content consumption. \n\n The system includes time-bound submission logic, daily content scheduling workflows, and secure user authentication to maintain integrity and fairness. I implemented scalable backend services and lightweight frontend components to ensure performance and reliability while keeping the interface distraction-free.",
    "images": [
      "daily-philosophy-1.png",
      "daily-philosophy-2.png"
    ],
    "links": {
      "view": "https://dailyphilosophy.rknastenka.com",
      "code": "https://github.com/kidus-befekadu"
    }
  },
  {
    "name": "Restaurant Site",
    "desc": "Designed and developed a sophisticated, high-performance restaurant website using Next.js to showcase a fictional fine dining brand. \n\n The platform was built to reflect a premium dining experience through refined UI design, structured content presentation, and seamless navigation across menu offerings, team profiles, and ambiance highlights.I implemented server-side rendering and optimized routing to ensure strong performance, SEO visibility, and fast load times. The booking workflow was engineered with form validation, secure data handling, and backend integration to simulate real-world reservation management. \n\n The architecture emphasized clean component structure, reusable UI patterns, and responsive design to ensure consistency across devices. Throughout the project, I focused on balancing aesthetics with performance, applying modern frontend engineering practices while maintaining scalability and maintainability. The result is a production-ready web experience that demonstrates strong full-stack fundamentals, user-centered design, and attention to detail in both functionality and presentation.",
    "images": [
      "restaurant-site-1.png",
      "restaurant-site-2.png"
    ],
    "links": {
      "view": "https://www.benoldham.dev/projects/fine-dining-restaurant/",
      "code": "https://github.com/kidus-befekadu"
    }
  }
]
